a=int(input())
b=int(input())
c=int(input())
p=((a+b+c)/2)
S=(p*((p-a)*(p-b)*(p-c)))
print(S**0.5)

number = input() #номер билета состоит из 6 цифр
# print(number[0])
# print(number[1])
# print(number[2])
# print(number[3])
# print(number[4])
# print(number[5])
if (int(number[0])+int(number[1])+int(number[2])) == (int(number[3])+int(number[4])+int(number[5])):
    print('Счастливый')
else:
    print('Обычный')

num = int(input())
b = float('inf') #для обозначения бесконечной
if -15<num<=12 or 14<num<17 or 19<=num<b: # (−15,12]∪(14,17)∪[19,+∞)
    print('True')
else:
    print('False')

num1 = float(input()) #Первое число
num2 = float(input()) #Второе число
operation = str(input()) #Операция
if operation == '+':
   print(num1+num2)
elif operation == '-':
    print(num1-num2)
elif operation == '/' and num2 == 0:
    print('Деление на 0!')
elif operation == '/' and num2 != 0:
    print(num1/num2)
elif operation == '*':
    print(num1 * num2)
elif operation == 'mod' and num2 == 0:
    print('Деление на 0!')
elif operation == 'mod' and num2 != 0:
    print(num1%num2)
elif operation == 'pow' and num1 != 0:
    print(num1**num2)
elif operation == 'div' and num2 == 0:
    print('Деление на 0!')
elif operation == 'div' and num2 != 0:
    print(num1//num2)

shape = str(input())
if shape == 'треугольник':
    a = int(input()) #сторона треугольника
    b = int(input()) #сторона треугольника
    c = int(input()) #сторона треугольника
    i=((a+b+c)/2)
    print((i*((i-a)*(i-b)*(i-c)))**0.5)
elif shape == 'прямоугольник':
    a = int(input()) #сторона прямоугольника
    b = int(input()) #сторона прямоугольника
    print(a*b)
elif shape == 'круг':
    r = float(input()) #радиус
    pi = 3.14
    print (pi*(r**2))

# num = int(input()) #Количество программистов
# if num == 0:
#     print(num, 'программстов')
# elif num == 1:
#     print(num, 'программист')
# elif 2<=num<5:
#     print(num, 'программиста')
# elif 5<=num<21:
#     print(num, 'программистов')
# elif num == 21:
#     print(num, 'программист')
# elif 22<=num<24:
#     print(num, 'программиста')
# elif 25<=num<30:
#     print(num, 'программистов')

num = int(input()) #Количество программистов
if num%1000 in [1,21,31,41,51,61,71,81,91,101,121,131,141,151,161,171,181,191,201,221,231,241,251,261,271,281,291,321,331,341,351,361,371,381,391,421,431,441,451,461,471,781,491,501,521,531,541,551,561,571,581,591,601,621,631,641,651,661,671,681,691,701,721,731,741,751,761,771,781,791,801,821,831,841,851,861,871,881,891,901,921,931,941,951,961,971,981,991]:
    print(num, 'программист')
elif num%1000 in [2,3,4,22,23,24,32,33,34,42,43,44,52,53,54,62,63,64,72,73,74,82,83,84,92,93,94,102,103,104,122,123,124,132,133,134,142,143,144,152,153,154,162,163,164,172,173,174,182,183,184,192,193,194,202,203,204,222,223,224,232,242,243,244,252,253,254,262,263,264,272,273,274,282,283,284,292,293,294,302,303,304,322,323,324,332,333,334,342,343,344,352,353,354,362,363,364,372,373,374,382,383,384,402,403,404,422,423,424,432,433,434,442,443,444,452,453,454,462,463,464,472,473,474,482,483,484,492,493,494,502,503,504,522,523,524,532,533,534,542,543,544,552,553,554,562,563,564,572,573,574,582,583,584,592,593,594,602,603,604,622,623,624,632,633,634,642,643,644,652,653,654,662,663,664,672,673,674,682,683,684,692,693,694,702,703,704,722,723,724,732,733,734,742,743,744,752,753,754,762,763,764,772,773,774,782,783,784,792,793,794,802,803,804,822,823,824,832,833,834,842,843,844,852,853,854,862,863,864,852,853,854,862,863,864,872,873,874,882,883,884,892,893,894,902,903,904,922,923,924,932,933,934,942,943,944,952,953,954,962,963,964,972,973,974,982,983,984,992,993,994]:
    print(num, 'программиста')
else:
    print(num, 'программистов')

a = int(input())
b = int(input())
c = int(input())
print(max(a, b, c))
print(min(a, b, c))